performance/k6/payment-small-result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: reservation-load-test.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m15s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 45s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  00.8s/45.0s

running (0m01.9s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 01/10 VUs  01.8s/45.0s

running (0m02.9s), 01/10 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 01/10 VUs  02.8s/45.0s

running (0m03.9s), 02/10 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 02/10 VUs  03.8s/45.0s

running (0m04.9s), 02/10 VUs, 4 complete and 0 interrupted iterations
default   [  11% ] 02/10 VUs  04.8s/45.0s

running (0m05.9s), 02/10 VUs, 6 complete and 0 interrupted iterations
default   [  13% ] 02/10 VUs  05.8s/45.0s

running (0m06.9s), 02/10 VUs, 8 complete and 0 interrupted iterations
default   [  15% ] 02/10 VUs  06.8s/45.0s

running (0m07.9s), 03/10 VUs, 10 complete and 0 interrupted iterations
default   [  17% ] 03/10 VUs  07.8s/45.0s

running (0m08.9s), 03/10 VUs, 13 complete and 0 interrupted iterations
default   [  20% ] 03/10 VUs  08.8s/45.0s

running (0m09.9s), 03/10 VUs, 16 complete and 0 interrupted iterations
default   [  22% ] 03/10 VUs  09.8s/45.0s

running (0m10.9s), 03/10 VUs, 18 complete and 0 interrupted iterations
default   [  24% ] 03/10 VUs  10.8s/45.0s

running (0m11.9s), 04/10 VUs, 20 complete and 0 interrupted iterations
default   [  26% ] 04/10 VUs  11.8s/45.0s

running (0m12.9s), 04/10 VUs, 24 complete and 0 interrupted iterations
default   [  28% ] 04/10 VUs  12.8s/45.0s

running (0m13.9s), 04/10 VUs, 28 complete and 0 interrupted iterations
default   [  31% ] 04/10 VUs  13.8s/45.0s

running (0m14.9s), 04/10 VUs, 32 complete and 0 interrupted iterations
default   [  33% ] 04/10 VUs  14.8s/45.0s

running (0m15.9s), 05/10 VUs, 36 complete and 0 interrupted iterations
default   [  35% ] 05/10 VUs  15.8s/45.0s

running (0m16.9s), 05/10 VUs, 41 complete and 0 interrupted iterations
default   [  37% ] 05/10 VUs  16.8s/45.0s

running (0m17.9s), 05/10 VUs, 46 complete and 0 interrupted iterations
default   [  40% ] 05/10 VUs  17.8s/45.0s

running (0m18.9s), 06/10 VUs, 49 complete and 0 interrupted iterations
default   [  42% ] 06/10 VUs  18.8s/45.0s

running (0m19.9s), 06/10 VUs, 55 complete and 0 interrupted iterations
default   [  44% ] 06/10 VUs  19.8s/45.0s

running (0m20.9s), 06/10 VUs, 61 complete and 0 interrupted iterations
default   [  46% ] 06/10 VUs  20.8s/45.0s

running (0m21.9s), 07/10 VUs, 67 complete and 0 interrupted iterations
default   [  48% ] 07/10 VUs  21.8s/45.0s

running (0m22.9s), 07/10 VUs, 73 complete and 0 interrupted iterations
default   [  51% ] 07/10 VUs  22.8s/45.0s

running (0m23.9s), 07/10 VUs, 80 complete and 0 interrupted iterations
default   [  53% ] 07/10 VUs  23.8s/45.0s

running (0m24.9s), 08/10 VUs, 87 complete and 0 interrupted iterations
default   [  55% ] 08/10 VUs  24.8s/45.0s

running (0m25.9s), 08/10 VUs, 93 complete and 0 interrupted iterations
default   [  57% ] 08/10 VUs  25.8s/45.0s

running (0m26.9s), 08/10 VUs, 101 complete and 0 interrupted iterations
default   [  60% ] 08/10 VUs  26.8s/45.0s

running (0m27.9s), 09/10 VUs, 109 complete and 0 interrupted iterations
default   [  62% ] 09/10 VUs  27.8s/45.0s

running (0m28.9s), 09/10 VUs, 118 complete and 0 interrupted iterations
default   [  64% ] 09/10 VUs  28.8s/45.0s

running (0m29.9s), 09/10 VUs, 126 complete and 0 interrupted iterations
default   [  66% ] 09/10 VUs  29.8s/45.0s

running (0m30.9s), 10/10 VUs, 135 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  30.8s/45.0s

running (0m31.9s), 10/10 VUs, 142 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  31.8s/45.0s

running (0m32.9s), 09/10 VUs, 152 complete and 0 interrupted iterations
default   [  73% ] 09/10 VUs  32.8s/45.0s

running (0m33.9s), 08/10 VUs, 161 complete and 0 interrupted iterations
default   [  75% ] 08/10 VUs  33.8s/45.0s

running (0m34.9s), 08/10 VUs, 168 complete and 0 interrupted iterations
default   [  77% ] 08/10 VUs  34.8s/45.0s

running (0m35.9s), 07/10 VUs, 175 complete and 0 interrupted iterations
default   [  80% ] 07/10 VUs  35.8s/45.0s

running (0m36.9s), 06/10 VUs, 182 complete and 0 interrupted iterations
default   [  82% ] 06/10 VUs  36.8s/45.0s

running (0m37.9s), 05/10 VUs, 188 complete and 0 interrupted iterations
default   [  84% ] 05/10 VUs  37.8s/45.0s

running (0m38.9s), 05/10 VUs, 191 complete and 0 interrupted iterations
default   [  86% ] 05/10 VUs  38.8s/45.0s

running (0m39.9s), 05/10 VUs, 196 complete and 0 interrupted iterations
default   [  88% ] 05/10 VUs  39.8s/45.0s

running (0m40.9s), 04/10 VUs, 199 complete and 0 interrupted iterations
default   [  91% ] 04/10 VUs  40.8s/45.0s

running (0m41.9s), 04/10 VUs, 199 complete and 0 interrupted iterations
default   [  93% ] 04/10 VUs  41.8s/45.0s

running (0m42.9s), 02/10 VUs, 203 complete and 0 interrupted iterations
default   [  95% ] 02/10 VUs  42.8s/45.0s

running (0m43.9s), 02/10 VUs, 203 complete and 0 interrupted iterations
default   [  97% ] 02/10 VUs  43.8s/45.0s

running (0m44.9s), 01/10 VUs, 205 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  44.8s/45.0s

running (0m45.9s), 01/10 VUs, 206 complete and 0 interrupted iterations
default ↓ [ 100% ] 01/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s


  █ THRESHOLDS 

    checks{type:login}
    ✓ 'rate>0.99' rate=100.00%

    checks{type:pay}
    ✓ 'rate>0.90' rate=91.78%

    checks{type:reserve_attempt}
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=110.11ms


  █ TOTAL RESULTS 

    checks_total.......: 1037   22.429968/s
    checks_succeeded...: 96.72% 1003 out of 1037
    checks_failed......: 3.27%  34 out of 1037

    ✓ login status is 200
    ✓ login token exists
    ✓ reserve attempt handled
    ✓ reserve status is 200
    ✓ reservation id exists
    ✗ pay status is 200
      ↳  91% — ✓ 190 / ✗ 17
    ✗ payment marked paid
      ↳  91% — ✓ 190 / ✗ 17

    CUSTOM
    reservation_attempts...........: 207    4.477342/s

    HTTP
    http_req_duration..............: avg=54.88ms min=22.32ms med=45.61ms max=1.59s p(90)=70.6ms  p(95)=110.11ms
      { expected_response:true }...: avg=54.66ms min=22.32ms med=45.38ms max=1.59s p(90)=70.32ms p(95)=109.68ms
    http_req_failed................: 4.09%  17 out of 415
    http_reqs......................: 415    8.976313/s

    EXECUTION
    iteration_duration.............: avg=1.12s   min=1.06s   med=1.07s   max=2.99s p(90)=1.14s   p(95)=1.16s   
    iterations.....................: 207    4.477342/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 197 kB 4.3 kB/s
    data_sent......................: 132 kB 2.9 kB/s



running (0m46.2s), 00/10 VUs, 207 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s